v2206/solver_ADMFoam/ADTank_lam/0.orig/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7  
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions          [0 2 -2 0 0 0 0];

internalField       uniform 0;

boundaryField
{
    allBoundary
    {
        type            fixedFluxPressure;
        rho             rhok;
        value           uniform 0;
    }

    top
    {
        type            fixedFluxPressure;
        rho             rhok;
        value           uniform 0;
    }

    GeoTank
    {
        type            fixedFluxPressure;
        rho             rhok;
        value           uniform 0;
    }

    GeoShaft
    {
        type            fixedFluxPressure;
        rho             rhok;
        value           uniform 0;
    }

        
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
