v2206/solver_ADMFoam/ADTank_lam/0.orig/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    allBoundary
    {
        // type            zeroGradient;
        type            calculated;
        value           uniform 0;
    }

    top
    {
        //  type           zeroGradient;
        type            calculated;
        value           uniform 0;
    }

    GeoTank
    {
        // type            zeroGradient;
        type            nutkWallFunction;
        value           uniform 0;
    }

    GeoShaft
    {
        // type            zeroGradient;
        type            nutkWallFunction;
        value           uniform 0;
    }
}


// ************************************************************************* //
