v2206/solver_ADMFoam/ADTank_lam/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    // default         steadyState;
    // default         backward;
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default         Gauss linear;

    div(phi,U)      Gauss LUST grad(U);

    div(phi,k)      Gauss limitedLinear 1;
    div(phi,epsilon) Gauss linear;
    div(phi,R)      Gauss linear;
    div(R)          Gauss linear;

    div(phi,T)      Gauss upwind;
    div(phi,Yi)     Gauss upwind;
    div(phi,S*)     Gauss linearUpwind;
    div(phi,G*)     Gauss linearUpwind;

    div((nuEff*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear limited corrected 0.5;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

// ************************************************************************* //
