v2206/solver_ADMFoam/ADTank_lam/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p_rgh
    {
        solver          GAMG;
        smoother        GaussSeidel;
        tolerance       1e-6;
        relTol          0.01;
    }

    p_rghFinal
    {
        $p_rgh;
        relTol          0;
    }

    "(U|k|omega|epsilon)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-6;
        relTol          0.01;
        // solver          PBiCGStab;
        // preconditioner  DILU;
        // tolerance       1e-6;
        // relTol          1e-6;
    }

    "(U|k|omega|epsilon)Final"
    {
        $U;
        relTol          0;
    }

    "(T|Yi|S*|G*)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-6;
        relTol          1e-6; // <--- high relTol leads to inhomogeneity issue
    }

    "(T|Yi|S*|G*)Final"
    {
        $T;
        relTol          0;
    }
}

PIMPLE
{
    momentumPredictor no;
    nOuterCorrectors 2;
    nCorrectors      1;
    nNonOrthogonalCorrectors 0;
    pRefCell        0;
    pRefValue       0;
}

relaxationFactors
{
    equations
    {
        U                   0.95;
        Y*                  0.95;
        // "(k|omega|epsilon)" 0.95;
    }
}

// SIMPLE
// {
//     nNonOrthogonalCorrectors 2;
//     consistent      yes;
//     pRefCell		0;
//     pRefValue		0;
//     residualControl
//     {
//         U                   1e-4;
//         p                   1e-4;
//         "(k|epsilon|omega)" 1e-4;
//     }
// }

// ************************************************************************* //
