v2206/solver_ADMFoam/ADTank_lam/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    // volScalarFieldValue s 1e-3
    volScalarFieldValue Ssu     0.012394   
    volScalarFieldValue Saa     0.005500   
    volScalarFieldValue Sfa     0.107400   
    volScalarFieldValue Sva     0.012300   
    volScalarFieldValue Sbu     0.014000   
    volScalarFieldValue Spro    0.01760  
    volScalarFieldValue Sac     0.089300
    volScalarFieldValue Sh2     2.5055e-7
    volScalarFieldValue Sch4    0.05550  
    volScalarFieldValue SIC     0.095100   
    volScalarFieldValue SIN     0.094500   
    volScalarFieldValue SI      0.130900   
    volScalarFieldValue Xc      0.107900     
    volScalarFieldValue Xch     0.020500   
    volScalarFieldValue Xpr     0.084200   
    volScalarFieldValue Xli     0.043600   
    volScalarFieldValue Xsu     0.312200   
    volScalarFieldValue Xaa     0.93170    
    volScalarFieldValue Xfa     0.338400   
    volScalarFieldValue Xc4     0.32580   
    volScalarFieldValue Xpro    0.10110  
    volScalarFieldValue Xac     0.677200   
    volScalarFieldValue Xh2     0.284800   
    volScalarFieldValue XI      17.21620   
    volScalarFieldValue Snh3    0.001884
    volScalarFieldValue Gh2     1.1032e-5
    volScalarFieldValue Gch4    1.65350
    volScalarFieldValue Gco2    0.013500
);

regions
(
    boxToCell
    {
        box (-0.2   -0.2   0.0) (0.20   0.20   0.20);
        fieldValues
        (
            volScalarFieldValue Ssu     0.003473066
            volScalarFieldValue Saa     0.000783034
            volScalarFieldValue Sfa     0.069303505
            volScalarFieldValue Sva     0.003873214
            volScalarFieldValue Sbu     0.004351346
            volScalarFieldValue Spro    0.008958764
            volScalarFieldValue Sac     0.052241454
            volScalarFieldValue Sh2     1.18e-07
            volScalarFieldValue Sch4    0.041437073
            volScalarFieldValue SIC     0.094941878
            volScalarFieldValue SIN     0.094882071
            volScalarFieldValue SI      0.13202994
            volScalarFieldValue Xc      0.10902922
            volScalarFieldValue Xch     0.003503202
            volScalarFieldValue Xpr     0.0114329
            volScalarFieldValue Xli     0.006854437
            volScalarFieldValue Xsu     0.31391266
            volScalarFieldValue Xaa     0.93418788
            volScalarFieldValue Xfa     0.34155632
            volScalarFieldValue Xc4     0.3278901
            volScalarFieldValue Xpro    0.10197613
            volScalarFieldValue Xac     0.68321958
            volScalarFieldValue Xh2     0.28685419
            volScalarFieldValue XI      7.21846
            volScalarFieldValue Snh3    0.0021251483
            volScalarFieldValue Snh4    0.092756919
            volScalarFieldValue Gh2     6.31e-06
            volScalarFieldValue Gch4    1.5083096
            volScalarFieldValue Gco2    0.015222102
            volScalarFieldValue Sco2    0.00832486
            volScalarFieldValue ShP     4.73e-08
        );
    }

    // boxToCell
    // {
    //     box (0.4   -0.20   0.00) (0.60  0.00   0.10);
    //     fieldValues
    //     (
    //         volScalarFieldValue alpha.lightFluid 0
    //         volScalarFieldValue alpha.denseFluid 1
    //         volScalarFieldValue T 250
    //     );
    // }
);


// ************************************************************************* //
